#language: ru
@all
Функционал: Яндекс Маркет


  Сценарий: Поиск телевизора на яндекс маркете

    Когда Перейти в яндекс маркет "market"
    Когда Перейти на вторую вкладку
    Когда Выбран раздел Электроника"Электроника"
    Когда Выбран раздел Телевизоры "Телевизоры"
    Когда Выбран расширенный поиск "Все фильтры"
    Когда Задан параметр поиска от 20000 рублей "20000"
    Когда Нажата кнопка все бренды
    Когда Выбран производитель Samsung
    Когда Выбран производитель LG
    Когда Нажата кнопку Применить
    Тогда Проверено, что элементов на странице 12 "48"
    Когда Сохранен первый элемент в списке
    Когда В поисковую строку введено сохраненное значение
    Тогда Найти и проверить, что наименование товара соответствует сохраненному значению

