#language: ru
@all
Функционал: Яндекс Маркет


  Сценарий: Поиск телевизора на яндекс маркете

  Когда Перейти в яндекс маркет "market"
  Когда Перейти на вторую вкладку
  Когда Выбран раздел Электроника"Электроника"
  Когда Выбран раздел Телевизоры "Телевизоры"
  Когда Выбран расширенный поиск "Все фильтры"
  Когда Задан параметр поиска от 20000 рублей "20000"
  Когда Выбран производитель Samsung "Samsung"
  Когда Выбран производитель LG "LG"
  Когда Нажата кнопку Применить "Показать"
  Тогда Проверено, что элементов на странице 12 "12"
  Когда Сохранен первый элемент в списке
  Когда В поисковую строку введено сохраненное значение "Искать товары"
  Тогда Найти и проверить, что наименование товара соответствует сохраненному значению

